; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	image7 - mode
	spectrograph1 - mode
	thermograph3 - mode
	image0 - mode
	image8 - mode
	image5 - mode
	image2 - mode
	infrared6 - mode
	image4 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image7)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 image4)
	(supports instrument3 image2)
	(calibration_target instrument3 Star0)
	(supports instrument4 image4)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph3)
	(supports instrument5 image5)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument6 spectrograph1)
	(supports instrument6 image4)
	(calibration_target instrument6 Star0)
	(supports instrument7 image8)
	(supports instrument7 image5)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 image4)
	(supports instrument8 image0)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument9 infrared6)
	(supports instrument9 image2)
	(supports instrument9 image5)
	(calibration_target instrument9 Star0)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon5)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 image0)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
)
(:goal (and
	(pointing satellite2 Phenomenon5)
	(pointing satellite4 Phenomenon5)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon5 infrared6)
	(have_image Star6 thermograph3)
	(have_image Star6 image0)
	(have_image Planet7 image2)
	(have_image Star8 image0)
	(have_image Star8 image5)
	(have_image Star8 thermograph3)
	(have_image Planet9 image4)
))

)

; plan
1. (turn_to satellite4 star0 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star0)
   goals met: 0 of 12
2. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 12
3. (calibrate satellite4 instrument9 star0)
   added: (calibrated instrument9)
   goals met: 0 of 12
4. (turn_to satellite4 planet7 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet7)
   goals met: 0 of 12
5. (take_image satellite4 planet7 instrument9 image2)
   added: (have_image planet7 image2)
   goals met: 1 of 12
6. (turn_to satellite4 phenomenon5 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 phenomenon5)
   goals met: 2 of 12
7. (turn_to satellite2 groundstation4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation4)
   goals met: 2 of 12
8. (turn_to satellite0 groundstation2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 12
9. (take_image satellite4 phenomenon5 instrument9 infrared6)
   added: (have_image phenomenon5 infrared6)
   goals met: 3 of 12
10. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 3 of 12
11. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 12
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 12
13. (calibrate satellite3 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 3 of 12
14. (calibrate satellite2 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 3 of 12
15. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 12
16. (turn_to satellite0 phenomenon5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 12
17. (take_image satellite0 phenomenon5 instrument1 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 4 of 12
18. (turn_to satellite2 star6 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star6)
   goals met: 4 of 12
19. (take_image satellite2 star6 instrument5 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 5 of 12
20. (turn_to satellite2 star8 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star8)
   goals met: 5 of 12
21. (take_image satellite2 star8 instrument5 image5)
   added: (have_image star8 image5)
   goals met: 6 of 12
22. (take_image satellite2 star8 instrument5 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 7 of 12
23. (turn_to satellite2 phenomenon5 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon5)
   goals met: 8 of 12
24. (take_image satellite2 phenomenon5 instrument5 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 9 of 12
25. (turn_to satellite3 planet9 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet9)
   goals met: 9 of 12
26. (take_image satellite3 planet9 instrument8 image4)
   added: (have_image planet9 image4)
   goals met: 10 of 12
27. (turn_to satellite3 star6 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star6)
   goals met: 10 of 12
28. (take_image satellite3 star6 instrument8 image0)
   added: (have_image star6 image0)
   goals met: 11 of 12
29. (turn_to satellite3 star8 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star8)
   goals met: 11 of 12
30. (take_image satellite3 star8 instrument8 image0)
   added: (have_image star8 image0)
   goals met: 12 of 12
